doom/config.org
#+STARTUP: overview
* Sane Defaults
#+begin_src emacs-lisp
(setq gcmh-idle-delay 5
      gcmh-high-cons-threshold (* 100 1024 1024)
      gcmh-verbose doom-debug-p)

(setq-default
 delete-by-moving-to-trash t
 window-combination-resize t)

(setq mac-mouse-wheel-smooth-scroll t)

;; Increase amount of data read from process
(setq read-process-output-max (* 1024 1024)) ;; 1mb
#+end_src
* User Details
#+begin_src emacs-lisp
(setq user-full-name "Eugene Rwagasore"
      user-mail-address "rwagasore@gmail.com")
#+end_src
* Font Rendering
#+begin_src emacs-lisp
(plist-put! +ligatures-extra-symbols
  ;; org
  :name          "»"
  :src_block     "»"
  :src_block_end "«"
  :quote         "“"
  :quote_end     "”"
  ;; Functional
  :lambda        "𝝺"
  :def           "ƒ"
  :composition   "∘"
  :map           "⯮"
  ;; Types
  :null          "ф"
  :true          "⊤"
  :false         "⊥"
  ;; Flow
  :not           "￢"
  :in            "∈"
  :not-in        "∉"
  :and           "∧"
  :or            "∨"
  :for           "∀"
  :some          "∃"
  :return        "↪"
  :yield         "↦"
  ;; Other
  :union         "⋃"
  :intersect     "∩"
  :diff          "∖"
  :dot           "•")
(setq doom-font (font-spec :family "Iosevka Custom" :size 14 :weight 'Regular))
#+end_src
* Theme Configurations
#+begin_src emacs-lisp
(setq doom-theme 'zaiste)

(after! doom-theme
  (setq doom-themes-enable-bold nil
        doom-themes-enable-italic nil))
#+end_src
* UI Configurations
#+begin_src emacs-lisp
;; Disable Emacs killing confirmation
(setq confirm-kill-emacs nil)

;; Use Twitter emojis instead
(setq emojify-emoji-set "twemoji-v2")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type nil)

;; Maximize the window to fullscreen
;; (add-to-list 'initial-frame-alist '(fullscreen . maximized))

;; enable transparent titlebar with dark-mode
(add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
(add-to-list 'default-frame-alist '(ns-appearance . dark))

;; Customize the cursor
(setq-default
 cursor-type '(bar . 1)
 blink-cursor-delay 0
 blink-cursor-interval 0.4
 x-stretch-cursor t)

(blink-cursor-mode t)
#+end_src
* Text, Notes, Journaling, etc..
** Org Mode
#+begin_src emacs-lisp
;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq
 org-log-done 'time
 org-tags-column -80
 org-directory "~/Orgfiles/"
 org-roam-directory "~/Orgfiles/roam/"
 org-agenda-files (directory-files-recursively "~/Orgfiles/roam/daily/" "\.org$")
 org-todo-keywords '((sequence "TODO(t)" "INPROGRESS(i)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)"))
 org-todo-keyword-faces
 '(("TODO" :foreground "#7C7C75" :weight normal :underline t)
   ("WAITING" :foreground "#9F7EFE" :weight normal :underline t)
   ("INPROGRESS" :foreground "#0098DD" :weight normal :underline t)
   ("DONE" :foreground "#50A14F" :weight normal :underline t)
   ("CANCELLED" :foreground "#FF6480" :weight normal :underline t)))

(after! org-superstar
  (setq
   org-superstar-headline-bullets-list '("⁖")))

(after! org-fancy-priorities
  (setq
   org-priority-highest '?A
   org-priority-lowest  '?D
   org-priority-default '?B
   org-priority-faces '((?A :foreground "#E45649")
                        (?B :foreground "#DA8548")
                        (?C :foreground "#0098DD")
                        (?D :foreground "#7C7C75"))
   org-fancy-priorities-list '("[#A - NOW]" "[#B - NEXT]" "[#C - LAST]" "[#D - MAYBE]")))
#+end_src
* Languages Configurations
** Astro configuration
#+begin_src emacs-lisp
(add-to-list 'auto-mode-alist '("\\.astro\\'" . typescript-tsx-mode))
#+end_src
** Web Mode Configurations
#+begin_src emacs-lisp
(setq indent-tabs-mode nil
      web-mode-attr-indent-offset nil
      js-indent-level 2
      typescript-indent-level 2
      tab-width 2
      web-mode-code-indent-offset 2
      web-mode-css-indent-offset 2
      web-mode-markup-indent-offset 2

      web-mode-enable-auto-closing t
      web-mode-enable-auto-pairing t
      web-mode-auto-close-style 2
      web-mode-tag-auto-close-style 2)
#+end_src
** Python Mode Configurations
#+begin_src emacs-lisp
(setq-default flycheck-python-flake8-executable "flake8helled")
(setq-default lsp-pyls-configuration-sources ["flake8helled"])
(setq-default lsp-pylsp-configuration-sources ["flake8helled"])
#+end_src
* Clients Configurations
** LSP
#+begin_src emacs-lisp
(after! lsp
  (setq lsp-log-io nil
        lsp-idle-delay 0.5
        lsp-enable-file-watchers nil
        lsp-eslint-auto-fix-on-save t))
#+end_src
** Company
#+begin_src emacs-lisp
(after! company
  (setq company-idle-delay 0.0
        company-minimum-prefix-length 1)
  (setq company-show-numbers t))
#+end_src
** Magit & Forge
#+begin_src emacs-lisp
;; Remove `--literal-pathspecs` argument which was causing `pre-commit` to fail
(after! magit
  (setq magit-git-global-arguments (remove "--literal-pathspecs" magit-git-global-arguments)))

(after! forge
  (push
   '("er.github.com" "api.github.com" "github.com" forge-github-repository)
   forge-alist))
#+end_src
